hathach/tinyusb/src/portable/wch/dcd_ch32_usbss.c
/*
 * The MIT License (MIT)
 *
 * Copyright (c) 2026, TinyUSB contributors
 *
 * Permission is hereby granted, free of charge, to any person obtaining a copy
 * of this software and associated documentation files (the "Software"), to deal
 * in the Software without restriction, including without limitation the rights
 * to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
 * copies of the Software, and to permit persons to whom the Software is
 * furnished to do so, subject to the following conditions:
 *
 * The above copyright notice and this permission notice shall be included in
 * all copies or substantial portions of the Software.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
 * AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
 * LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
 * OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN
 * THE SOFTWARE.
 *
 * This file is part of the TinyUSB stack.
 */

#include "tusb_option.h"

#if CFG_TUD_ENABLED && defined(TUP_USBIP_WCH_USBSS) && defined(CFG_TUD_WCH_USBIP_USBSS) && \
  (CFG_TUD_WCH_USBIP_USBSS == 1)

#include <string.h>

#include "ch32h417.h"
#include "ch32h417_flash.h"
#include "ch32h417_rcc.h"
#include "ch32h417_usb.h"

#include "device/dcd.h"

#define EP_MAX                8u
#define EP0_STATUS_IDLE       0xffu

#define USBSS_PHY_CFG_CR      (*((__IO uint32_t *)0x400341f8))
#define USBSS_PHY_CFG_DAT     (*((__IO uint32_t *)0x400341fc))

#define USBSS_FUNC_CFG        (*((__IO uint32_t *)0x5003c018))

#define LMP_HP                0u
#define LMP_SUBTYPE_MASK      (0x0fu << 5)
#define LMP_SET_LINK_FUNC     (0x01u << 5)
#define LMP_U2_INACT_TOUT     (0x02u << 5)
#define LMP_PORT_CAP          (0x04u << 5)
#define LMP_PORT_CFG          (0x05u << 5)
#define LMP_PORT_CFG_RES      (0x06u << 5)
#define LMP_LINK_SPEED        (1u << 9)
#define LMP_NUM_HP_BUF        (4u << 0)
#define LMP_UP_STREAM         (2u << 16)

typedef struct {
  uint8_t *buffer;
  uint16_t total_len;
  uint16_t queued_len;
  uint16_t max_size;
  uint8_t  max_burst;
} xfer_ctl_t;

typedef struct {
  xfer_ctl_t xfer[EP_MAX][2];
  uint8_t    dev_addr;
  uint8_t    ep0_status_ep;
  bool       set_addr_pending;
  bool       link_configured;
  bool       link_low_power;
  bool       link_reset_seen;
  bool       force_pm;
  bool       u1_enabled;
  bool       u2_enabled;
  uint8_t    chip_revision;
  uint32_t   last_lmp_subtype;
} dcd_data_t;

static dcd_data_t _dcd;

TU_ATTR_ALIGNED(4) static uint8_t ep0_buffer[512];

static inline volatile USBSS_EP_TX_TypeDef *ep_tx_reg(uint8_t ep_num) {
  return (volatile USBSS_EP_TX_TypeDef *)(&USBSSD->EP1_TX + ((ep_num - 1u) * 2u));
}

static inline volatile USBSS_EP_RX_TypeDef *ep_rx_reg(uint8_t ep_num) {
  return (volatile USBSS_EP_RX_TypeDef *)(&USBSSD->EP1_RX + ((ep_num - 1u) * 2u));
}

static inline xfer_ctl_t *xfer_ctl(uint8_t ep_num, tusb_dir_t dir) {
  return &_dcd.xfer[ep_num][dir];
}

static void delay_cycles(uint32_t count) {
  while (count--) {
    __NOP();
  }
}

static uint8_t chip_revision_get(void) {
  FLASH_BOOT_GetMode();
  return (uint8_t)(((*((__I uint32_t *)0x1ffff704)) >> 4) & 0x0fu);
}

static inline bool chip_has_rx_set_fc(void) {
  // WCH's USBSS example only enables RX_SET_FC on revision 3 and newer.
  // Older revisions use SET_LINK_FUNC LMPs for the equivalent U1/U2 policy.
  return _dcd.chip_revision >= 3u;
}

static void usbss_phy_cfg(uint8_t addr, uint16_t data) {
  USBSS_PHY_CFG_CR  = (1u << 23) | ((uint32_t)addr << 16) | data;
  USBSS_PHY_CFG_DAT = 0x01u;
}

static void usbss_pll_enable(bool en) {
  if (en) {
    RCC->CTLR |= RCC_USBSS_PLLON;
    while ((RCC->CTLR & RCC_USBSS_PLLRDY) == 0u) {}
  } else {
    RCC->CTLR &= ~RCC_USBSS_PLLON;
  }
}

static void usbss_clock_enable(bool en) {
  if (en) {
    usbss_pll_enable(true);
    RCC_HBPeriphClockCmd(RCC_HBPeriph_USBSS, ENABLE);
    RCC_PIPECmd(ENABLE);
    RCC_UTMIcmd(ENABLE);
    RCC_USBSS_PLLCmd(ENABLE);
  } else {
    RCC_HBPeriphClockCmd(RCC_HBPeriph_USBSS, DISABLE);
    RCC_UTMIcmd(DISABLE);
    RCC_PIPECmd(DISABLE);
    if ((RCC->PLLCFGR & RCC_SYSPLL_SEL) != RCC_SYSPLL_USBSS) {
      RCC_USBSS_PLLCmd(DISABLE);
    }
  }
}

static void usbss_phy_init(void) {
  usbss_phy_cfg(0x03, 0x7c12);
  usbss_phy_cfg(0x0d, 0x79aa);
  usbss_phy_cfg(0x15, 0x4430);
  usbss_phy_cfg(0x13, 0x0010);
  USBSS_FUNC_CFG = 0xb0054000;
}

static void usbss_set_address(uint8_t dev_addr) {
  USBSSD->USB_CONTROL = (USBSSD->USB_CONTROL & ~USBSS_DEV_ADDR_MASK) | ((uint32_t)dev_addr << 24);
}

static void link_power_apply(void) {
  uint32_t link_cfg = USBSSD->LINK_CFG & ~(LINK_U1_ALLOW | LINK_U2_ALLOW);

  if (_dcd.force_pm || _dcd.u1_enabled) {
    link_cfg |= LINK_U1_ALLOW;
  }

  if (_dcd.force_pm || _dcd.u2_enabled) {
    link_cfg |= LINK_U2_ALLOW;
  }

  USBSSD->LINK_CFG = link_cfg;
}

static void link_power_set(bool u1_enabled, bool u2_enabled) {
  _dcd.u1_enabled = u1_enabled;
  _dcd.u2_enabled = u2_enabled;
  link_power_apply();
}

static void ep0_rx_ready(void) {
  USBSSD->UEP0_RX_CTRL = USBSS_EP0_RX_ERDY | USBSS_EP0_RX_ACK;
}

static void ep0_tx_ready(uint32_t value) {
  USBSSD->UEP0_TX_CTRL = USBSS_EP0_TX_DPH | value;
  USBSSD->UEP0_TX_CTRL |= USBSS_EP0_TX_ERDY;
}

static void ep0_prepare(void) {
  USBSSD->UEP0_TX_DMA     = (uint32_t)ep0_buffer;
  USBSSD->UEP0_RX_DMA     = (uint32_t)ep0_buffer;
  USBSSD->UEP0_TX_DMA_OFS = 0;
  USBSSD->UEP0_RX_DMA_OFS = 0;
  USBSSD->UEP0_TX_CTRL    = 0;
  ep0_rx_ready();

  xfer_ctl(0, TUSB_DIR_OUT)->max_size = 512;
  xfer_ctl(0, TUSB_DIR_IN)->max_size  = 512;
  _dcd.ep0_status_ep                  = EP0_STATUS_IDLE;
}

static void edpt_clear(uint8_t ep_num, tusb_dir_t dir, uint8_t burst_packets) {
  if (ep_num == 0) {
    USBSSD->UEP0_TX_CTRL = 0;
    ep0_rx_ready();
  } else if (dir == TUSB_DIR_IN) {
    volatile USBSS_EP_TX_TypeDef *ep = ep_tx_reg(ep_num);
    ep->UEP_TX_CR                    = USBSS_EP_TX_CLR | USBSS_EP_TX_CHAIN_CLR;
    ep->UEP_TX_CR                    = burst_packets;
    ep->UEP_TX_ST                    = USBSS_EP_TX_INT_FLAG;
    ep->UEP_TX_CHAIN_ST              = USBSS_EP_TX_CHAIN_IF;
  } else {
    volatile USBSS_EP_RX_TypeDef *ep = ep_rx_reg(ep_num);
    ep->UEP_RX_CR                    = USBSS_EP_RX_CLR | USBSS_EP_RX_CHAIN_CLR;
    ep->UEP_RX_CR                    = burst_packets;
    ep->UEP_RX_ST                    = USBSS_EP_RX_INT_FLAG;
    ep->UEP_RX_CHAIN_ST              = USBSS_EP_RX_CHAIN_IF;
  }
}

