hathach/tinyusb/src/portable/wch/dcd_ch32_usbss.c
static void endpoints_reset(void) {
  USBSSD->USB_CONTROL |= USBSS_USB_CLR_ALL;
  USBSSD->USB_CONTROL &= ~USBSS_USB_CLR_ALL;
  USBSSD->UEP_TX_EN = 0;
  USBSSD->UEP_RX_EN = 0;

  for (uint8_t ep = 1; ep < EP_MAX; ep++) {
    edpt_clear(ep, TUSB_DIR_IN, 1);
    edpt_clear(ep, TUSB_DIR_OUT, 1);
  }

  ep0_prepare();
}

static void protocol_reset(void) {
  USBSSD->USB_CONTROL |= USBSS_FORCE_RST;
  USBSSD->USB_STATUS  = USBSS_UIF_TRANSFER | USBSS_UDIF_SETUP | USBSS_UDIF_STATUS | USBSS_UIF_ITP | USBSS_UIF_RX_PING |
                        USBSS_UIF_FIFO_RXOV | USBSS_UIF_FIFO_TXOV;
  USBSSD->USB_CONTROL = USBSS_UIE_TRANSFER | USBSS_UDIE_SETUP | USBSS_UDIE_STATUS | USBSS_DMA_EN | USBSS_SETUP_FLOW;
}

static void usbss_hw_init(void) {
  usbss_clock_enable(true);
  usbss_phy_init();

  USBSSD->LINK_CFG  = LINK_RX_EQ_EN | LINK_TX_DEEMPH_MASK | LINK_PHY_RESET;
  USBSSD->LINK_CTRL = LINK_P2_MODE | LINK_GO_DISABLED;
  USBSSD->LINK_CFG  = LINK_RX_EQ_EN | LINK_TX_DEEMPH_MASK | LINK_LTSSM_MODE | LINK_TOUT_MODE;
  USBSSD->LINK_LPM_CR |= LINK_LPM_EN;
  USBSSD->LINK_CFG |= LINK_RX_TERM_EN;
  USBSSD->LINK_INT_CTRL = LINK_IE_TX_LMP | LINK_IE_RX_LMP | LINK_IE_RX_LMP_TOUT |
                          LINK_IE_STATE_CHG | LINK_IE_WARM_RST | LINK_IE_TERM_PRES;
  if (chip_has_rx_set_fc()) {
    USBSSD->LINK_INT_CTRL |= LINK_IE_RX_SET_FC;
  }
  USBSSD->LINK_CTRL     = LINK_P2_MODE;
  USBSSD->LINK_U1_WKUP_TMR    = 120;
  USBSSD->LINK_U1_WKUP_FILTER = 50;
  USBSSD->LINK_U2_WKUP_FILTER = 0;
  USBSSD->LINK_U3_WKUP_FILTER = 0;

  protocol_reset();
  endpoints_reset();
}

static void usbss_hw_deinit(void) {
  USBSSD->USB_CONTROL = USBSS_FORCE_RST;
  USBSSD->LINK_CFG |= LINK_PHY_RESET | U3_LINK_RESET;
  USBSSD->LINK_CTRL |= LINK_GO_DISABLED;
  delay_cycles(1000);
  USBSSD->USB_CONTROL &= ~USBSS_FORCE_RST;
  USBSSD->LINK_CFG &= ~(LINK_PHY_RESET | U3_LINK_RESET);
  usbss_clock_enable(false);
}

static void queue_ep0_xfer(uint8_t ep_addr, uint8_t *buffer, uint16_t total_bytes) {
  const tusb_dir_t dir  = tu_edpt_dir(ep_addr);
  xfer_ctl_t      *xfer = xfer_ctl(0, dir);

  xfer->buffer     = buffer;
  xfer->total_len  = total_bytes;
  xfer->queued_len = 0;

  if (total_bytes == 0) {
    _dcd.ep0_status_ep = ep_addr;
    if (dir == TUSB_DIR_IN) {
      ep0_tx_ready(0);
      ep0_rx_ready();
    } else {
      ep0_rx_ready();
    }
    return;
  }

  if (dir == TUSB_DIR_IN) {
    const uint16_t len = tu_min16(total_bytes, 512);
    memcpy(ep0_buffer, buffer, len);
    xfer->queued_len     = len;
    USBSSD->UEP0_TX_DMA  = (uint32_t)ep0_buffer;
    ep0_tx_ready(len);
  } else {
    USBSSD->UEP0_RX_DMA  = (uint32_t)ep0_buffer;
    ep0_rx_ready();
  }
}

static uint8_t chain_packet_count(uint16_t bytes, xfer_ctl_t const *xfer) {
  uint16_t packets = (bytes == 0) ? 1 : (uint16_t)((bytes + xfer->max_size - 1u) / xfer->max_size);
  return (uint8_t)tu_min16(packets, (uint16_t)(xfer->max_burst + 1u));
}

static void queue_data_xfer(uint8_t ep_num, tusb_dir_t dir, xfer_ctl_t *xfer) {
  const uint16_t remaining   = (uint16_t)(xfer->total_len - xfer->queued_len);
  const uint8_t  nump        = chain_packet_count(remaining, xfer);
  const uint16_t chain_bytes = (remaining == 0) ? 0 : tu_min16(remaining, (uint16_t)(nump * xfer->max_size));
  const uint16_t last_len =
    (chain_bytes == 0) ? 0 : ((chain_bytes % xfer->max_size) ? (chain_bytes % xfer->max_size) : xfer->max_size);

  if (dir == TUSB_DIR_IN) {
    volatile USBSS_EP_TX_TypeDef *ep = ep_tx_reg(ep_num);
    ep->UEP_TX_DMA                   = (uint32_t)(chain_bytes ? &xfer->buffer[xfer->queued_len] : ep0_buffer);
    ep->UEP_TX_DMA_OFS               = xfer->max_size;
    ep->UEP_TX_CHAIN_LEN             = last_len;
    ep->UEP_TX_CHAIN_EXP_NUMP        = nump;
    ep->UEP_TX_CHAIN_ST              = USBSS_EP_TX_CHAIN_IF;
    xfer->queued_len                 = (uint16_t)(xfer->queued_len + chain_bytes);
  } else {
    volatile USBSS_EP_RX_TypeDef *ep = ep_rx_reg(ep_num);
    ep->UEP_RX_DMA                   = (uint32_t)(chain_bytes ? &xfer->buffer[xfer->queued_len] : ep0_buffer);
    ep->UEP_RX_DMA_OFS               = xfer->max_size;
    ep->UEP_RX_CHAIN_MAX_NUMP        = nump;
    ep->UEP_RX_CHAIN_ST              = USBSS_EP_RX_CHAIN_IF;
  }
}

static void handle_ep0_in(uint8_t rhport) {
  xfer_ctl_t *xfer = xfer_ctl(0, TUSB_DIR_IN);

  if (xfer->queued_len >= xfer->total_len) {
    USBSSD->UEP0_TX_CTRL = USBSS_EP0_TX_DPH;
    ep0_rx_ready();
    dcd_event_xfer_complete(rhport, TU_EP0_IN, xfer->queued_len, XFER_RESULT_SUCCESS, true);
    return;
  }

  const uint16_t len = tu_min16((uint16_t)(xfer->total_len - xfer->queued_len), 512);
  const uint8_t  seq = (uint8_t)(((USBSSD->UEP0_TX_CTRL >> 16) & 0x1fu) + 1u);
  memcpy(ep0_buffer, &xfer->buffer[xfer->queued_len], len);
  xfer->queued_len     = (uint16_t)(xfer->queued_len + len);
  ep0_tx_ready(((uint32_t)seq << 16) | len);
}

static void handle_ep0_out(uint8_t rhport) {
  xfer_ctl_t    *xfer   = xfer_ctl(0, TUSB_DIR_OUT);
  const uint16_t rx_len = (uint16_t)(USBSSD->UEP0_RX_CTRL & USBSS_EP0_RX_LEN_MASK);
  const uint16_t remaining = (uint16_t)(xfer->total_len - xfer->queued_len);
  const uint16_t copy_len = tu_min16(rx_len, remaining);

  if (copy_len > 0 && xfer->buffer != NULL) {
    // TODO: Treat rx_len > remaining as a control transfer protocol error instead of silently truncating.
    memcpy(&xfer->buffer[xfer->queued_len], ep0_buffer, copy_len);
  }
  xfer->queued_len = (uint16_t)(xfer->queued_len + copy_len);
  ep0_rx_ready();

  if (xfer->queued_len >= xfer->total_len || rx_len < xfer->max_size) {
    dcd_event_xfer_complete(rhport, TU_EP0_OUT, xfer->queued_len, XFER_RESULT_SUCCESS, true);
  }
}

static void handle_data_in(uint8_t rhport, uint8_t ep_num) {
  volatile USBSS_EP_TX_TypeDef *ep   = ep_tx_reg(ep_num);
  xfer_ctl_t                   *xfer = xfer_ctl(ep_num, TUSB_DIR_IN);

  ep->UEP_TX_CHAIN_ST = USBSS_EP_TX_CHAIN_IF;
  if (xfer->queued_len >= xfer->total_len) {
    dcd_event_xfer_complete(rhport, tu_edpt_addr(ep_num, TUSB_DIR_IN), xfer->queued_len, XFER_RESULT_SUCCESS, true);
  } else {
    queue_data_xfer(ep_num, TUSB_DIR_IN, xfer);
  }
}

static void handle_data_out(uint8_t rhport, uint8_t ep_num) {
  volatile USBSS_EP_RX_TypeDef *ep   = ep_rx_reg(ep_num);
  xfer_ctl_t                   *xfer = xfer_ctl(ep_num, TUSB_DIR_OUT);

  uint16_t      rx_len  = ep->UEP_RX_CHAIN_LEN;
  const uint8_t rx_nump = ep->UEP_RX_CHAIN_NUMP;
  if (rx_nump > 1) {
    rx_len = (uint16_t)(((uint16_t)(rx_nump - 1u) * xfer->max_size) + rx_len);
  }

  ep->UEP_RX_CHAIN_ST = USBSS_EP_RX_CHAIN_IF;
  xfer->queued_len    = (uint16_t)(xfer->queued_len + rx_len);

  if (xfer->queued_len >= xfer->total_len || rx_len < (uint16_t)(rx_nump * xfer->max_size)) {
    dcd_event_xfer_complete(rhport, tu_edpt_addr(ep_num, TUSB_DIR_OUT), xfer->queued_len, XFER_RESULT_SUCCESS, true);
  } else {
    queue_data_xfer(ep_num, TUSB_DIR_OUT, xfer);
  }
}

static void handle_transfer(uint8_t rhport, uint32_t status) {
  const uint8_t    ep_num = (uint8_t)((status & USBSS_EP_ID_MASK) >> 8);
  const tusb_dir_t dir    = (status & USBSS_EP_DIR_MASK) ? TUSB_DIR_IN : TUSB_DIR_OUT;

  if (ep_num == 0) {
    if (dir == TUSB_DIR_IN) {
      handle_ep0_in(rhport);
    } else {
      handle_ep0_out(rhport);
    }
  } else if (dir == TUSB_DIR_IN) {
    handle_data_in(rhport, ep_num);
  } else {
    handle_data_out(rhport, ep_num);
  }
}

static void handle_link_reset(uint8_t rhport) {
  protocol_reset();
  endpoints_reset();
  usbss_set_address(0);
  _dcd.dev_addr         = 0;
  _dcd.set_addr_pending = false;
  _dcd.link_configured  = false;
  _dcd.link_low_power   = false;
  _dcd.link_reset_seen  = true;
  _dcd.last_lmp_subtype = 0;
  _dcd.force_pm         = false;
  link_power_set(false, false);
  dcd_event_bus_reset(rhport, TUSB_SPEED_SUPER, true);
}

