hathach/tinyusb/src/portable/wch/dcd_ch32_usbss.c
static void handle_link_configured(uint8_t rhport) {
  if (!_dcd.link_reset_seen) {
    // U0 can be the first reliable indication that SuperSpeed link training completed.
    // Notify TinyUSB of SS speed without resetting the USBSS protocol/endpoint state.
    _dcd.link_reset_seen = true;
    dcd_event_bus_reset(rhport, TUSB_SPEED_SUPER, true);
  }

  _dcd.link_configured = true;
}

static void tx_port_cap_lmp(void) {
  USBSSD->LINK_LMP_TX_DATA0 = LMP_LINK_SPEED | LMP_PORT_CAP | LMP_HP;
  USBSSD->LINK_LMP_TX_DATA1 = LMP_UP_STREAM | LMP_NUM_HP_BUF;
  USBSSD->LINK_LMP_TX_DATA2 = 0;
}

static void tx_port_cfg_res_lmp(void) {
  USBSSD->LINK_LMP_TX_DATA0 = LMP_LINK_SPEED | LMP_PORT_CFG_RES | LMP_HP;
  USBSSD->LINK_LMP_TX_DATA1 = 0;
  USBSSD->LINK_LMP_TX_DATA2 = 0;
  USBSSD->LINK_LMP_PORT_CAP |= LINK_LMP_TX_CAP_VLD;
}

static void handle_link_irq(uint8_t rhport) {
  const uint32_t link_int   = USBSSD->LINK_INT_FLAG;
  const uint32_t link_state = USBSSD->LINK_STATUS & LINK_STATE_MASK;

  if (chip_has_rx_set_fc() && (link_int & LINK_IF_RX_SET_FC)) {
    // Revision 3+ reports forced power-management policy through RX_SET_FC.
    USBSSD->LINK_INT_FLAG = LINK_IF_RX_SET_FC;
    _dcd.force_pm = (USBSSD->LINK_LMP_PORT_CAP & FORCE_PM) != 0;
    link_power_apply();
  }

  if (link_int & LINK_IF_STATE_CHG) {
    USBSSD->LINK_INT_FLAG = LINK_IF_STATE_CHG;

    if (link_state == LINK_STATE_RXDET) {
      protocol_reset();
      endpoints_reset();
      usbss_set_address(0);
      _dcd.dev_addr = 0;
      _dcd.set_addr_pending = false;
      _dcd.ep0_status_ep = EP0_STATUS_IDLE;
      _dcd.link_configured = false;
      _dcd.link_low_power = false;
      _dcd.link_reset_seen = false;
      _dcd.force_pm = false;
      link_power_set(false, false);
    } else if (link_state == LINK_STATE_RECOVERY) {
      if (_dcd.link_low_power) {
        _dcd.link_low_power = false;
        delay_cycles(4000);
        usbss_phy_cfg(0x12, 0x67c8);
      }
    } else if (link_state == LINK_STATE_DISABLE) {
      USBSSD->LINK_CTRL &= ~LINK_GO_DISABLED;
    } else if (link_state == LINK_STATE_U0) {
      handle_link_configured(rhport);
    } else if (link_state == LINK_STATE_U1 || link_state == LINK_STATE_U2 || link_state == LINK_STATE_U3) {
      _dcd.link_low_power = true;
      usbss_phy_cfg(0x12, (uint16_t)(0x67c8 & ~(1u << 9)));
    } else if (link_state == LINK_STATE_HOTRST) {
      handle_link_reset(rhport);
      USBSSD->LINK_CTRL &= ~LINK_HOT_RESET;
    }
  }

  if (link_int & LINK_IF_TERM_PRES) {
    USBSSD->LINK_INT_FLAG = LINK_IF_TERM_PRES;
    if ((USBSSD->LINK_STATUS & LINK_RX_TERM_PRES) == 0) {
      dcd_event_bus_signal(rhport, DCD_EVENT_UNPLUGGED, true);
      _dcd.link_reset_seen = false;
      _dcd.link_configured = false;
    }
  }

  if (link_int & LINK_IF_TX_LMP) {
    USBSSD->LINK_INT_FLAG = LINK_IF_TX_LMP;
    tx_port_cap_lmp();
  }

  if (link_int & LINK_IF_RX_LMP) {
    USBSSD->LINK_INT_FLAG = LINK_IF_RX_LMP;

    const uint32_t lmp_data0 = USBSSD->LINK_LMP_RX_DATA0;
    _dcd.last_lmp_subtype = lmp_data0 & LMP_SUBTYPE_MASK;

    if (_dcd.last_lmp_subtype == LMP_PORT_CAP) {
      tx_port_cap_lmp();
    } else if (_dcd.last_lmp_subtype == LMP_PORT_CFG) {
      tx_port_cfg_res_lmp();
      _dcd.link_configured = true;
    } else if (_dcd.last_lmp_subtype == LMP_PORT_CFG_RES) {
      USBSSD->LINK_LMP_PORT_CAP |= LINK_LMP_TX_CAP_VLD;
      _dcd.link_configured = true;
    } else if (_dcd.last_lmp_subtype == LMP_U2_INACT_TOUT) {
      USBSSD->LINK_U2_INACT_TIMER = (uint8_t)((lmp_data0 >> 9) & 0xffu);
    } else if (!chip_has_rx_set_fc() && _dcd.last_lmp_subtype == LMP_SET_LINK_FUNC) {
      // Pre-revision-3 silicon uses SET_LINK_FUNC instead of RX_SET_FC.
      if (lmp_data0 & (0x02u << 9)) {
        link_power_set(true, true);
      } else {
        link_power_set(false, false);
      }
    }
  }

  if (link_int & LINK_IF_RX_LMP_TOUT) {
    USBSSD->LINK_INT_FLAG = LINK_IF_RX_LMP_TOUT;
    USBSSD->LINK_CTRL |= LINK_GO_DISABLED;
    USBSSD->LINK_CTRL |= LINK_GO_RX_DET;
    // Timeout recovery changes LTSSM state; ignore any stale flags from this snapshot.
    return;
  }

  if (link_int & LINK_IF_WARM_RST) {
    USBSSD->LINK_INT_FLAG = LINK_IF_WARM_RST;
    if (USBSSD->LINK_STATUS & LINK_RX_WARM_RST) {
      handle_link_reset(rhport);
      USBSSD->LINK_CTRL |= LINK_GO_DISABLED;
      delay_cycles(16);
      USBSSD->LINK_CTRL &= ~LINK_GO_DISABLED;
    }
  }
}

bool dcd_init(uint8_t rhport, const tusb_rhport_init_t *rh_init) {
  (void)rhport;
  (void)rh_init;

  memset(&_dcd, 0, sizeof(_dcd));
  _dcd.ep0_status_ep = EP0_STATUS_IDLE;
  _dcd.chip_revision = chip_revision_get();
  usbss_hw_init();
  return true;
}

bool dcd_deinit(uint8_t rhport) {
  (void)rhport;
  dcd_int_disable(rhport);
  usbss_hw_deinit();
  return true;
}

void dcd_int_enable(uint8_t rhport) {
  (void)rhport;
  NVIC_EnableIRQ(USBSS_IRQn);
  NVIC_EnableIRQ(USBSS_LINK_IRQn);
}

void dcd_int_disable(uint8_t rhport) {
  (void)rhport;
  NVIC_DisableIRQ(USBSS_LINK_IRQn);
  NVIC_DisableIRQ(USBSS_IRQn);
}

void dcd_connect(uint8_t rhport) {
  (void)rhport;
  USBSSD->LINK_CTRL &= ~LINK_GO_DISABLED;
  USBSSD->LINK_CFG |= LINK_RX_TERM_EN;
}

void dcd_disconnect(uint8_t rhport) {
  (void)rhport;
  USBSSD->LINK_CFG &= ~LINK_RX_TERM_EN;
  USBSSD->LINK_CTRL |= LINK_GO_DISABLED;
}

void dcd_set_address(uint8_t rhport, uint8_t dev_addr) {
  _dcd.dev_addr = dev_addr;
  _dcd.set_addr_pending = true;
  dcd_edpt_xfer(rhport, TU_EP0_IN, NULL, 0, false);
}

void dcd_edpt0_status_complete(uint8_t rhport, const tusb_control_request_t *request) {
  (void)rhport;

  if (_dcd.set_addr_pending &&
      request->bmRequestType_bit.recipient == TUSB_REQ_RCPT_DEVICE &&
      request->bmRequestType_bit.type == TUSB_REQ_TYPE_STANDARD &&
      request->bRequest == TUSB_REQ_SET_ADDRESS) {
    usbss_set_address(_dcd.dev_addr);
    _dcd.set_addr_pending = false;
  } else if (request->bmRequestType_bit.recipient == TUSB_REQ_RCPT_DEVICE &&
             request->bmRequestType_bit.type == TUSB_REQ_TYPE_STANDARD) {
    if (request->bRequest == TUSB_REQ_SET_FEATURE) {
      if (request->wValue == TUSB_REQ_FEATURE_U1_ENABLE) {
        _dcd.u1_enabled = true;
        link_power_apply();
      } else if (request->wValue == TUSB_REQ_FEATURE_U2_ENABLE) {
        _dcd.u2_enabled = true;
        link_power_apply();
      }
    } else if (request->bRequest == TUSB_REQ_CLEAR_FEATURE) {
      if (request->wValue == TUSB_REQ_FEATURE_U1_ENABLE) {
        _dcd.u1_enabled = false;
        link_power_apply();
      } else if (request->wValue == TUSB_REQ_FEATURE_U2_ENABLE) {
        _dcd.u2_enabled = false;
        link_power_apply();
      }
    } else if (request->bRequest == TUSB_REQ_SET_ISOCH_DELAY) {
      USBSSD->LINK_ISO_DLY = request->wValue;
    }
  }
}

void dcd_remote_wakeup(uint8_t rhport) {
  (void)rhport;
  USBSSD->LINK_CTRL |= LINK_TX_UX_EXIT;
}

