hathach/tinyusb/src/portable/wch/dcd_ch32_usbss.c
void dcd_sof_enable(uint8_t rhport, bool en) {
  (void)rhport;
  if (en) {
    USBSSD->USB_CONTROL |= USBSS_UIE_ITP | USBSS_ITP_EN;
  } else {
    USBSSD->USB_CONTROL &= ~(USBSS_UIE_ITP | USBSS_ITP_EN);
  }
}

void dcd_edpt_close_all(uint8_t rhport) {
  (void)rhport;

  USBSSD->UEP_TX_EN = 0;
  USBSSD->UEP_RX_EN = 0;
  for (uint8_t ep = 1; ep < EP_MAX; ep++) {
    edpt_clear(ep, TUSB_DIR_IN, 1);
    edpt_clear(ep, TUSB_DIR_OUT, 1);
    memset(&_dcd.xfer[ep], 0, sizeof(_dcd.xfer[ep]));
  }
}

bool dcd_edpt_open(uint8_t rhport, const tusb_desc_endpoint_t *desc_edpt, uint8_t const * desc_end) {
  (void)rhport;

  const uint8_t    ep_num = tu_edpt_number(desc_edpt->bEndpointAddress);
  const tusb_dir_t dir    = tu_edpt_dir(desc_edpt->bEndpointAddress);
  TU_ASSERT(ep_num < EP_MAX);

  if (ep_num == 0) {
    return true;
  }

  xfer_ctl_t *xfer = xfer_ctl(ep_num, dir);
  xfer->max_size = tu_edpt_packet_size(desc_edpt);
  xfer->max_burst = 0;

  uint8_t const *desc_next = tu_desc_next(desc_edpt);
  if (tu_desc_in_bounds(desc_next, desc_end) && TUSB_DESC_SUPERSPEED_ENDPOINT_COMPANION == tu_desc_type(desc_next)) {
    xfer->max_burst = desc_next[2];
  }
  const uint8_t burst_packets = (uint8_t)(xfer->max_burst + 1u);

  const bool is_iso = desc_edpt->bmAttributes.xfer == TUSB_XFER_ISOCHRONOUS;

  if (dir == TUSB_DIR_IN) {
    volatile USBSS_EP_TX_TypeDef *ep = ep_tx_reg(ep_num);
    ep->UEP_TX_CFG =
      USBSS_EP_TX_CHAIN_AUTO | USBSS_EP_TX_ERDY_AUTO | USBSS_EP_TX_SEQ_AUTO | (is_iso ? USBSS_EP_TX_ISO_MODE : 0);
    ep->UEP_TX_CR = USBSS_EP_TX_CLR | USBSS_EP_TX_CHAIN_CLR;
    ep->UEP_TX_CR = burst_packets;
    USBSSD->UEP_TX_EN |= (uint16_t)(1u << ep_num);
  } else {
    volatile USBSS_EP_RX_TypeDef *ep = ep_rx_reg(ep_num);
    ep->UEP_RX_CFG =
      USBSS_EP_RX_CHAIN_AUTO | USBSS_EP_RX_ERDY_AUTO | USBSS_EP_RX_SEQ_AUTO | (is_iso ? USBSS_EP_RX_ISO_MODE : 0);
    ep->UEP_RX_CR = USBSS_EP_RX_CLR | USBSS_EP_RX_CHAIN_CLR;
    ep->UEP_RX_CR = burst_packets;
    USBSSD->UEP_RX_EN |= (uint16_t)(1u << ep_num);
  }

  return true;
}

void dcd_edpt_close(uint8_t rhport, uint8_t ep_addr) {
  (void)rhport;

  const uint8_t    ep_num = tu_edpt_number(ep_addr);
  const tusb_dir_t dir    = tu_edpt_dir(ep_addr);

  if (ep_num == 0 || ep_num >= EP_MAX) {
    return;
  }

  if (dir == TUSB_DIR_IN) {
    USBSSD->UEP_TX_EN &= (uint16_t)~(1u << ep_num);
  } else {
    USBSSD->UEP_RX_EN &= (uint16_t)~(1u << ep_num);
  }
  edpt_clear(ep_num, dir, 1);
}

bool dcd_edpt_xfer(uint8_t rhport, uint8_t ep_addr, uint8_t *buffer, uint16_t total_bytes, bool is_isr) {
  (void)rhport;
  (void)is_isr;

  const uint8_t    ep_num = tu_edpt_number(ep_addr);
  const tusb_dir_t dir    = tu_edpt_dir(ep_addr);
  TU_ASSERT(ep_num < EP_MAX);

  if (ep_num == 0) {
    queue_ep0_xfer(ep_addr, buffer, total_bytes);
    return true;
  }

  xfer_ctl_t *xfer = xfer_ctl(ep_num, dir);
  xfer->buffer     = buffer;
  xfer->total_len  = total_bytes;
  xfer->queued_len = 0;
  queue_data_xfer(ep_num, dir, xfer);

  return true;
}

void dcd_edpt_stall(uint8_t rhport, uint8_t ep_addr) {
  (void)rhport;

  const uint8_t    ep_num = tu_edpt_number(ep_addr);
  const tusb_dir_t dir    = tu_edpt_dir(ep_addr);

  if (ep_num == 0) {
    if (dir == TUSB_DIR_IN) {
      USBSSD->UEP0_TX_CTRL = USBSS_EP0_TX_STALL;
    } else {
      USBSSD->UEP0_RX_CTRL = USBSS_EP0_RX_ERDY | USBSS_EP0_RX_STALL;
    }
  } else if (dir == TUSB_DIR_IN) {
    const uint8_t burst_packets = (uint8_t)(xfer_ctl(ep_num, dir)->max_burst + 1u);
    volatile USBSS_EP_TX_TypeDef *ep = ep_tx_reg(ep_num);
    uint8_t cr = (uint8_t)((ep->UEP_TX_CR & (uint8_t)~USBSS_EP_TX_ERDY_NUMP_MASK) |
                           USBSS_EP_TX_HALT | burst_packets);
    ep->UEP_TX_CR = cr;
    // Wake a flow-controlled endpoint so the next host service attempt sees STALL.
    ep->UEP_TX_ST = USBSS_EP_TX_ERDY_REQ;
  } else {
    const uint8_t burst_packets = (uint8_t)(xfer_ctl(ep_num, dir)->max_burst + 1u);
    volatile USBSS_EP_RX_TypeDef *ep = ep_rx_reg(ep_num);
    uint8_t cr = (uint8_t)((ep->UEP_RX_CR & (uint8_t)~USBSS_EP_RX_ERDY_NUMP_MASK) |
                           USBSS_EP_RX_HALT | burst_packets);
    ep->UEP_RX_CR = cr;
    // Wake a flow-controlled endpoint so the next host service attempt sees STALL.
    ep->UEP_RX_ST = USBSS_EP_RX_ERDY_REQ;
  }
}

void dcd_edpt_clear_stall(uint8_t rhport, uint8_t ep_addr) {
  (void)rhport;

  const uint8_t    ep_num = tu_edpt_number(ep_addr);
  const tusb_dir_t dir    = tu_edpt_dir(ep_addr);

  if (ep_num == 0) {
    ep0_prepare();
  } else if (dir == TUSB_DIR_IN) {
    edpt_clear(ep_num, TUSB_DIR_IN, (uint8_t)(xfer_ctl(ep_num, dir)->max_burst + 1u));
  } else {
    edpt_clear(ep_num, TUSB_DIR_OUT, (uint8_t)(xfer_ctl(ep_num, dir)->max_burst + 1u));
  }
}

void dcd_int_handler(uint8_t rhport) {
  handle_link_irq(rhport);

  const uint32_t status = USBSSD->USB_STATUS;

  if ((status & USBSS_UDIF_SETUP) && !(status & USBSS_UDIF_STATUS)) {
    _dcd.ep0_status_ep = EP0_STATUS_IDLE;
    _dcd.set_addr_pending = false;
    USBSSD->UEP0_TX_CTRL = 0;
    USBSSD->UEP0_RX_CTRL = 0;

    USBSSD->USB_STATUS = USBSS_UDIF_SETUP;
    dcd_event_setup_received(rhport, ep0_buffer, true);
  } else if (status & USBSS_UDIF_STATUS) {
    USBSSD->USB_STATUS = USBSS_UDIF_STATUS;

    if (_dcd.set_addr_pending) {
      usbss_set_address(_dcd.dev_addr);
      _dcd.set_addr_pending = false;
    }

    USBSSD->UEP0_TX_CTRL = 0;
    ep0_rx_ready();

    if (_dcd.ep0_status_ep != EP0_STATUS_IDLE) {
      const uint8_t ep_addr = _dcd.ep0_status_ep;
      _dcd.ep0_status_ep    = EP0_STATUS_IDLE;
      dcd_event_xfer_complete(rhport, ep_addr, 0, XFER_RESULT_SUCCESS, true);
    }
  } else if (status & USBSS_UIF_TRANSFER) {
    handle_transfer(rhport, status);
  } else if ((status & USBSS_UIF_ITP) && (USBSSD->USB_CONTROL & USBSS_UIE_ITP)) {
    dcd_event_sof(rhport, USBSSD->USB_ITP & USBSS_ITP_INTERVAL_MASK, true);
    USBSSD->USB_STATUS = USBSS_UIF_ITP;
  } else if (status & (USBSS_UIF_FIFO_RXOV | USBSS_UIF_FIFO_TXOV | USBSS_UIF_RX_PING)) {
    USBSSD->USB_STATUS = status & (USBSS_UIF_FIFO_RXOV | USBSS_UIF_FIFO_TXOV | USBSS_UIF_RX_PING);
  }
}

#endif
